/*
 *  ¼±ÅÃ Á¶°Ç¹®
 *  if(Á¶°Ç¹®)
 *  {
 *  	Á¶°Ç¹®ÀÌ true¸é ¼öÇàÇÏ´Â ¹®Àå ±¸Çö
 *  }
 *  else
 *  {
 *  	Á¶°Ç¹®ÀÌ falseÀÏ¶§ ¼öÇàÇÏ´Â ¹®Àå ±¸Çö
 *  }  
 *  	  	
 *  Á¶°Ç¹® ==> 137page 
 *  == ´ÜÀÏ
 *  <
 *  >
 *  !=
 *  
 *  ====== Á¶°Ç ¿©·¯°³ ÀÏ °æ¿ì 
 *  &&
 *  ||
 *  ======
 *  
 *  ch>='A' && ch<='2'
 *  ch>='0' && ch<='9'
 *  ch>='°¡' && ch<='ÆR' ==> ¹øÈ£°¡ ÀÏ·üÀûÀ¸·Î ..
 *  
 *  1,2,3,4,5,6,7,8,9 
 *  1,2,5,7,9
 *  ch==1 || ch==2 || ch==3 || ch==5 || ch==7 || ch==9
 *  
 *  ¹®ÀÚ¿­ ==> !=,== »ç¿ëÇÏÁö ¾Ê´Â´Ù.
 * 	//¹®ÀÚ¿­ÀÌ °°³Ä ´Ù¸£³Ä ÇÒ¶§´Â equals¸¦ ¾´´Ù.
 *  equals() -> ÆĞ½º¿öµå °Ë»öÇÒ¶§
 *  !equals()
 *	
 */
import java.util.*;
public class Á¦¾î¹®_¼±ÅÃÁ¶°Ç¹® {

	public static void main(String[] args) {
		//¹®ÀÚ ÇÑ°³¸¦ ÀÔ·ÂÀ» ¹Ş¾Æ¼­ => ¾ËÆÄºªÀÎÁö ¿©ºÎ È®ÀÎ
		//º¯¼ö ¼³Á¤ 
		char ch='A'; // º¯¼ö => ÃÊ±âÈ­ 
		
		/*
		 * 	int 	=> 0
		 * 	double 	=> 0.0
		 * 	long 	=> 0L
		 * 	boolean => false 
		 */
		//Å¬·¡½º´Â ¹İµå½Ã new¸¦ ºÙ¿©¾ÆÁö ÀúÀåÇÒ ¼ö ÀÖ´Ù.
		Scanner scan = new Scanner(System.in);
		System.out.print("¹®ÀÚ ÀÔ·Â:");
		ch=scan.next().charAt(0); //½ºÄ³³Ê´Â ¹®ÀÚ¿­ ÇÏ³ª¸¦ ¹Ş¾Æ¿ÀÁö ¸øÇÑ´Ù " "<-ÀÌ·±Çü½ÄÀ¸·Î ¹Ş¾Æ¿È
								  //"ABC" A=0 B=1 ÀÌ·±½ÄÀ¸·Î µû¶ó¼­ charAt(0)ÇÏ¸é ¸Ç¾Õ¿¡²¨ ÇÏ³ª¸¸ °¡Áö°í µé¾î¿Â´Ù
								  // ÀÚ¹Ù´Â ¸ğµç ½ÃÀÛ¹øÈ£°¡ 0¹øÀ¸·Î ½ÃÀÛÇÑ´Ù.
		
		
		if((ch >'A' && ch <='Z')||(ch>='a' && ch<='z')) {
			System.out.println(ch+"´Â(Àº) ¾ËÆÄºªÀÔ´Ï´Ù!!");
		}else {
			System.out.println(ch+"´Â(Àº) ¾ËÆÄºªÀÌ ¾Æ´Õ´Ï´Ù!!");
		}
		
		
		int a;
		System.out.print(" ¼ıÀÚ ÀÔ·Â:");
		a = scan.nextInt();
		if(a>=0 && a<=9) {
			System.out.println(a+"´Â(Àº) ¼ıÀÚÀÔ´Ï´Ù.");
			
		}else {
			System.out.println(a+"´Â(Àº) ¼ıÀÚ°¡ ¾Æ´Õ´Ï´Ù.");
		}
	}
}
